; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 978741 2 2 4 6 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	image2 - mode
	spectrograph1 - mode
	image0 - mode
	thermograph3 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	Star4 - direction
	Star2 - direction
	Star1 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 thermograph3)
	(supports instrument1 spectrograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star1)
	(supports instrument2 image2)
	(supports instrument2 image0)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
)
(:goal (and
	(have_image Planet6 spectrograph1)
	(have_image Star7 spectrograph1)
	(have_image Planet8 thermograph3)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 3
3. (turn_to satellite0 star7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star7)
   goals met: 0 of 3
4. (turn_to satellite1 star1 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star1)
   goals met: 0 of 3
5. (calibrate satellite1 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 0 of 3
6. (turn_to satellite0 planet8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet8)
   goals met: 0 of 3
7. (turn_to satellite1 star7 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star7)
   goals met: 0 of 3
8. (turn_to satellite0 planet6 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet6)
   goals met: 0 of 3
9. (take_image satellite1 star7 instrument1 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 1 of 3
10. (turn_to satellite0 star2 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star2)
   goals met: 1 of 3
11. (turn_to satellite1 planet8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet8)
   goals met: 1 of 3
12. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 1 of 3
13. (take_image satellite1 planet8 instrument1 thermograph3)
   added: (have_image planet8 thermograph3)
   goals met: 2 of 3
14. (turn_to satellite0 planet6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet6)
   goals met: 2 of 3
15. (take_image satellite0 planet6 instrument0 spectrograph1)
   added: (have_image planet6 spectrograph1)
   goals met: 3 of 3
